zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_spi.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(spi_struct)) {
        fw_debug_report_err(SPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg1 = SPI_CTL0(spi_periph);
        reg1 &= SPI_INIT_MASK;

        reg2 = SPI_CTL0(spi_periph);
        reg2 &= SPI_FIFO_INIT_MASK1;

        reg3 = SPI_CTL1(spi_periph);
        reg3 &= SPI_FIFO_INIT_MASK2;

        if(SPI0 == spi_periph) {
            /* select SPI as master or slave */
            reg1 |= (spi_struct->device_mode & SPI_MASTER);
            /* select SPI transfer mode */
            reg1 |= (spi_struct->trans_mode & SPI_TRANS_MODE_MASK);
            /* select SPI NSS use hardware or software */
            reg1 |= (spi_struct->nss & SPI_NSS_SOFT);
            /* select SPI LSB or MSB */
            reg1 |= (spi_struct->endian & SPI_ENDIAN_LSB);
            /* select SPI polarity and phase */
            reg1 |= (spi_struct->clock_polarity_phase & SPI_CK_PL_HIGH_PH_2EDGE);
            /* select SPI prescale to adjust transmit speed */
            reg1 |= (spi_struct->prescale & SPI_PSC_256);
            /* select SPI frame size */
            /* check SPI0 frame size is 8bits/16bits or not*/
            if((SPI_FRAMESIZE_8BIT != spi_struct->frame_size) && (SPI_FRAMESIZE_16BIT != spi_struct->frame_size)) {
                reval = ERROR;
            } else {
                reg1 |= (uint32_t)(spi_struct->frame_size & SPI_CTL0_FF16);
            }

            /* write to SPI_CTL0 register */
            SPI_CTL0(spi_periph) = (uint32_t)reg1;

        } else {
            /* select SPI as master or slave */
            reg2 |= (spi_struct->device_mode & SPI_MASTER);
            /* select SPI transfer mode */
            reg2 |= (spi_struct->trans_mode & SPI_TRANS_MODE_MASK);
            /* select SPI NSS use hardware or software */
            reg2 |= (spi_struct->nss & SPI_NSS_SOFT);
            /* select SPI LSB or MSB */
            reg2 |= (spi_struct->endian & SPI_ENDIAN_LSB);
            /* select SPI polarity and phase */
            reg2 |= (spi_struct->clock_polarity_phase & SPI_CK_PL_HIGH_PH_2EDGE);
            /* select SPI prescale to adjust transmit speed */
            reg2 |= (spi_struct->prescale & SPI_PSC_256);
            /* write to SPI_CTL0 register */
            SPI_CTL0(spi_periph) = (uint32_t)reg2;

            /* select SPI data size */
            reg3 |= (uint32_t)(spi_struct->frame_size & SPI_CTL1_DZ);
            /* write to SPI_CTL1 register */
            SPI_CTL1(spi_periph) = (uint32_t)reg3;
        }
    }
    /* select SPI mode */
    SPI_I2SCTL(spi_periph) &= (uint32_t)(~SPI_I2SCTL_I2SSEL);
    return reval;
}

/*!
    \brief      enable SPI (API_ID(0x0004U))
    \param[in]  spi_periph: SPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void spi_enable(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) |= (uint32_t)SPI_CTL0_SPIEN;
}

/*!
    \brief      disable SPI (API_ID(0x0005U))
    \param[in]  spi_periph: SPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void spi_disable(uint32_t spi_periph)
{
    SPI_CTL0(spi_periph) &= (uint32_t)(~SPI_CTL0_SPIEN);
}

/*!
    \brief      initialize I2S parameter (API_ID(0x0006U))
    \param[in]  spi_periph: SPIx(x=0)
    \param[in]  i2s_mode: I2S operation mode
                only one parameter can be selected which is shown as below:
      \arg        I2S_MODE_SLAVETX: I2S slave transmit mode
      \arg        I2S_MODE_SLAVERX: I2S slave receive mode
      \arg        I2S_MODE_MASTERTX: I2S master transmit mode
      \arg        I2S_MODE_MASTERRX: I2S master receive mode
    \param[in]  i2s_standard: I2S standard
                only one parameter can be selected which is shown as below:
      \arg        I2S_STD_PHILLIPS: I2S phillips standard
      \arg        I2S_STD_MSB: I2S MSB standard
      \arg        I2S_STD_LSB: I2S LSB standard
      \arg        I2S_STD_PCMSHORT: I2S PCM short standard
      \arg        I2S_STD_PCMLONG: I2S PCM long standard
    \param[in]  i2s_ckpl: I2S idle state clock polarity
                only one parameter can be selected which is shown as below:
      \arg        I2S_CKPL_LOW: I2S clock polarity low level
      \arg        I2S_CKPL_HIGH: I2S clock polarity high level
    \param[out] none
    \retval     none
*/
void i2s_init(uint32_t spi_periph, uint32_t i2s_mode, uint32_t i2s_standard, uint32_t i2s_ckpl)
{
    uint32_t reg;

    reg = SPI_I2SCTL(spi_periph);
    reg &= I2S_INIT_MASK;

    /* enable I2S mode */
    reg |= (uint32_t)SPI_I2SCTL_I2SSEL;
    /* select I2S mode */
    reg |= (uint32_t)(i2s_mode & I2S_MODE_MASTERRX);
    /* select I2S standard */
    reg |= (uint32_t)(i2s_standard & I2S_STANDARD_MASK);
    /* select I2S polarity */
    reg |= (uint32_t)(i2s_ckpl & I2S_CKPL_HIGH);

    /* write to SPI_I2SCTL register */
    SPI_I2SCTL(spi_periph) = (uint32_t)reg;
}

/*!
    \brief      configure I2S prescaler (API_ID(0x0007U))
    \param[in]  spi_periph: SPIx(x=0)
    \param[in]  i2s_audiosample: I2S audio sample rate
                only one parameter can be selected which is shown as below:
      \arg        I2S_AUDIOSAMPLE_8K: audio sample rate is 8KHz
      \arg        I2S_AUDIOSAMPLE_11K: audio sample rate is 11KHz
      \arg        I2S_AUDIOSAMPLE_16K: audio sample rate is 16KHz
      \arg        I2S_AUDIOSAMPLE_22K: audio sample rate is 22KHz
      \arg        I2S_AUDIOSAMPLE_32K: audio sample rate is 32KHz
      \arg        I2S_AUDIOSAMPLE_44K: audio sample rate is 44KHz
      \arg        I2S_AUDIOSAMPLE_48K: audio sample rate is 48KHz
      \arg        I2S_AUDIOSAMPLE_96K: audio sample rate is 96KHz
      \arg        I2S_AUDIOSAMPLE_192K: audio sample rate is 192KHz
    \param[in]  i2s_frameformat: I2S data length and channel length
                only one parameter can be selected which is shown as below:
      \arg        I2S_FRAMEFORMAT_DT16B_CH16B: I2S data length is 16 bit and channel length is 16 bit
      \arg        I2S_FRAMEFORMAT_DT16B_CH32B: I2S data length is 16 bit and channel length is 32 bit
      \arg        I2S_FRAMEFORMAT_DT24B_CH32B: I2S data length is 24 bit and channel length is 32 bit
      \arg        I2S_FRAMEFORMAT_DT32B_CH32B: I2S data length is 32 bit and channel length is 32 bit
    \param[in]  i2s_mckout: I2S master clock output
                only one parameter can be selected which is shown as below:
      \arg        I2S_MCKOUT_ENABLE: I2S master clock output enable
      \arg        I2S_MCKOUT_DISABLE: I2S master clock output disable
    \param[out] none
    \retval     none
*/
void i2s_psc_config(uint32_t spi_periph, uint32_t i2s_audiosample, uint32_t i2s_frameformat,
                    uint32_t i2s_mckout)
{
    uint32_t i2sdiv, i2sof;
    uint32_t clks;
    uint32_t i2sclock;

